In [1]:
import pandas as pd
job_data = pd.DataFrame({'Gender': ['M', 'F', 'M', 'F', 'M', 'M', 'F', 'F', 'M', 'M', 'F', 'M', 'M'], 
               'Age': [30, 40, 40, 25, 25, 25, 30, 30, 30, 40, 25, 30, 40],
               'JobTitle': ['Data Analyst', 'Data Engineer', 'Data Analyst', 'Data Scientist', 'Data Scientist', 'Data Scientist', 'Data Analyst', 'Data Engineer', 'Data Scientist', 'Data Engineer', 'Data Scientist', 'Data Analyst', 'Data Engineer'],
                'Salary': [100000, 150000, 150000, 100000, 130000, 150000, 130000, 150000, 150000, 150000, 100000, 130000, 130000],
                'Rating': [5, 6, 5, 7, 7, 7, 6, 6, 7, 8, 5, 4, 7],
                'CompanySize': [100, 100, 100, 1000, 1000, 1000, 1000, 1000, 100, 5000, 5000, 5000, 5000]})

In [2]:
job_data

   Gender  Age        JobTitle  Salary  Rating  CompanySize
0       M   30    Data Analyst  100000       5          100
1       F   40   Data Engineer  150000       6          100
2       M   40    Data Analyst  150000       5          100
3       F   25  Data Scientist  100000       7         1000
4       M   25  Data Scientist  130000       7         1000
5       M   25  Data Scientist  150000       7         1000
6       F   30    Data Analyst  130000       6         1000
7       F   30   Data Engineer  150000       6         1000
8       M   30  Data Scientist  150000       7          100
9       M   40   Data Engineer  150000       8         5000
10      F   25  Data Scientist  100000       5         5000
11      M   30    Data Analyst  130000       4         5000
12      M   40   Data Engineer  130000       7         5000

In [3]:
#summary

In [4]:
job_data.Age.describe()

count    13.000000
mean     31.538462
std       6.253204
min      25.000000
25%      25.000000
50%      30.000000
75%      40.000000
max      40.000000
Name: Age, dtype: float64

In [5]:
job_data.Age.mean()

31.53846153846154

In [6]:
job_data.JobTitle.unique()

array(['Data Analyst', 'Data Engineer', 'Data Scientist'], dtype=object)

In [7]:
job_data.JobTitle.value_counts()

Data Scientist    5
Data Analyst      4
Data Engineer     4
Name: JobTitle, dtype: int64

In [8]:
job_data.describe(include=['object'])

       Gender        JobTitle
count      13              13
unique      2               3
top         M  Data Scientist
freq        8               5

In [11]:
pd.crosstab(job_data['Gender'],job_data['JobTitle'])

JobTitle  Data Analyst  Data Engineer  Data Scientist
Gender
F                    1              2               2
M                    3              2               3